app/views/cashbook_indices/_form.html.erb

                  <% if @cashbook_index.previous.present? %>
                    <% @cashbook_index.previous.closing_cashes.each do |credit| %>
---
SELECT `closing_cashes`.* FROM `closing_cashes` WHERE `closing_cashes`.`cashbook_index_id` = 2