app/controllers/cashbook_indices_controller.rb

  def index

    @cashbook_indices = current_user.cashbook_indices.all
---
SELECT `cashbook_indices`.* FROM `cashbook_indices` WHERE `cashbook_indices`.`user_id` = 1

  def show
    @cashbook_index = current_user.cashbook_indices.find(params[:id])
    @credits = @cashbook_index.credits.all
    @debits = @cashbook_index.debits.all
    @closing_cashes = @cashbook_index.closing_cashes.all
---
SELECT  `cashbook_indices`.* FROM `cashbook_indices` WHERE `cashbook_indices`.`user_id` = 1 AND `cashbook_indices`.`id` = 1 LIMIT 1
SELECT  `cashbook_indices`.* FROM `cashbook_indices` ORDER BY `cashbook_indices`.`id` DESC LIMIT 1
SELECT `credits`.* FROM `credits` WHERE `credits`.`cashbook_index_id` = 1
SELECT `debits`.* FROM `debits` WHERE `debits`.`cashbook_index_id` = 1
SELECT `closing_cashes`.* FROM `closing_cashes` WHERE `closing_cashes`.`cashbook_index_id` = 1